a = int(input())
if 1900 <= a <=3000:
    if (a % 4 == 0) and ((a % 100 != 0) or (a % 400 == 0)):
        print("Високосный")
    else:
        print("Обычный")
# else:
#     print("Неверный год. Введите год из дипазона [1900;3000]")

# Вариант 2
print("Вариант 2")
print('Високосный' if not a%400 or not a%4 and a%100 else 'Обычный')

# Вариант 3
print("Вариант 3")
if 1900<=a<=3000:
    if a%400==0 or a%4==0 and a%100!=0:
        print("Високосный")
    else:
        print("Обычный")

# Вариант 4
print("Вариант 4")
print(f'{"Високосный" if (a%4==0 and a%100!=0) or (a%400==0) else "Обычный"}')



# Вариант 7
print("Вариант 7")
print(('Обычный','Високосный')[(a%400==0)-(a%100==0)+(a%4==0)])

# Вариант 6
print("Вариант 6")
if a % 400 ==0:
    print ("Високосный")
elif a %4 ==0:
    if a %100 != 0:
        print ("Високосный")
    else:
        print("Обычный")
else:
    print("Обычный")

# Вариант 5 (Лямбда, требуется ввод!)
print("Вариант 5")
print(['Обычный', 'Високосный'][(lambda x: x%4==0 and x%100!=0 or x%400==0)(int(input()))])
